# SurfaceSupport3D

Representation of Surface Support 3D in IDEA StatiCa Detail

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.surface_support3_d import SurfaceSupport3D

# TODO update the JSON string below
json = "{}"
# create an instance of SurfaceSupport3D from a JSON string
surface_support3_d_instance = SurfaceSupport3D.from_json(json)
# print the JSON string representation of the object
print(SurfaceSupport3D.to_json())

# convert the object into a dict
surface_support3_d_dict = surface_support3_d_instance.to_dict()
# create an instance of SurfaceSupport3D from a dict
surface_support3_d_from_dict = SurfaceSupport3D.from_dict(surface_support3_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)